In [11]:
my_dictionary={
    "name":"person 2",
    "age":35,
    "salary":400
}

In [12]:
print(my_dictionary)

{'name': 'person 2', 'age': 35, 'salary': 400}

In [14]:
my_dictionary={
    "name":["person 1","person 2","person 3","person 3","person 4","person 5",],
    "age":[35,100,34,456,67],
}

In [15]:
my_dictionary

{'name': ['person 1',
  'person 2',
  'person 3',
  'person 3',
  'person 4',
  'person 5'],
 'age': [35, 100, 34, 456, 67]}

In [47]:
#sorting data information of more than one person
my_dictionary={
    "name":["person 1","person 2","person 3","person 4","person 5",],
    "age":[35,100,34,456,67],
    "salary":[4000,5000,6000,7000,8000]
}

In [49]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [4000, 5000, 6000, 7000, 8000]}

In [ ]:
my_dictionary['location']=["mombasa","kisumu","nairobi","migori","kisii"]

In [18]:
my_dictionary

{'name': ['person 1',
  'person 2',
  'person 3',
  'person 3',
  'person 4',
  'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [4000, 5000, 6000, 7000, 8000]}

In [35]:
import pandas as pd

In [50]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [4000, 5000, 6000, 7000, 8000]}

In [67]:
my_dictionary["location"]=["nairobi","kisumu","kisii","nyeri","lamu"]

In [68]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [4000, 5000, 6000, 7000, 8000],
 'location': ['nairobi', 'kisumu', 'kisii', 'nyeri', 'lamu']}

In [ ]:
del my_dictionary("location")

In [70]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [4000, 5000, 6000, 7000, 8000],
 'location': ['nairobi', 'kisumu', 'kisii', 'nyeri', 'lamu']}

In [ ]:
my_dictionary("age")

In [72]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [4000, 5000, 6000, 7000, 8000],
 'location': ['nairobi', 'kisumu', 'kisii', 'nyeri', 'lamu']}

In [73]:
import pandas as pd

In [52]:
df=pd.DataFrame(my_dictionary)           df-function data frame-converting dictionary to a table

In [55]:
df

       name  age  salary
0  person 1   35    4000
1  person 2  100    5000
2  person 3   34    6000
3  person 4  456    7000
4  person 5   67    8000

In [60]:
df[["name","age"]]      accessing data from more than 1 column, use 2 brackets, from 1 column use 1 sqr bracket

       name  age
0  person 1   35
1  person 2  100
2  person 3   34
3  person 4  456
4  person 5   67

In [100]:
df["age"], df["salary"]=df["age"]+1, df["salary"]+500     # addying 1 to age and adding 500 to salaries

In [101]:
df

       name   age  salary
0  person 1  4004    4502
1  person 2  5004    5502
2  person 3  6004    6502
3  person 4  7004    7502
4  person 5  8004    8502

In [102]:
df

       name   age  salary
0  person 1  4004    4502
1  person 2  5004    5502
2  person 3  6004    6502
3  person 4  7004    7502
4  person 5  8004    8502

In [ ]:
df ["age"]=df["age"]+1

In [90]:
df

       name   age  salary
0  person 1  4003    4000
1  person 2  5003    5000
2  person 3  6003    6000
3  person 4  7003    7000
4  person 5  8003    8000

In [92]:
df["salary"] =df["salary"] +1

In [93]:
df["salary"]

0    4002
1    5002
2    6002
3    7002
4    8002
Name: salary, dtype: int64

In [88]:
df.dtypes      # keys converted to columns   # object-are strings

name      object
age        int64
salary     int64
dtype: object